DataProcessors/удалитьRenault_ОбменРекламациями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>удалитьRenault_ОбменРекламациями</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.удалитьRenault_Рекламации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/Renault_РекламацииСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_РекламацииСтатусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Draft</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Registered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Returned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Refreshed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Updated</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Closed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
					<Comment>Шины</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
					<Comment>Диски</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерныеАгрегаты</Name>
					<Comment>Номерные агрегаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛКМ</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опции</Name>
					<Comment>Опции автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_Рекламация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_Рекламация</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Заполняется автоматически перед записью нового документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктОПоврежденииСТК</Name>
					<Comment>Акт об обнаружении повреждений груза с ТК</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРекламации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_РекламацииВиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияГруза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификацияОтказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КлассификацияОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестЗафактурованно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестПовреждено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестПолучено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНормоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДилера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКоробки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТрН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТрН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоврежденноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредложениеИнициатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПредложенияПоРекламациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_РешенияПоРекламациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_РекламацииСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SAPPR_ВидЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/удалитьRenault_ОбменРекламациями/Ext/ObjectModule.bsl
Перем ВыборкаРекламаций;
Перем BIR;
Перем СервисФабрика;
Перем ВыгрузкаУспешна;
Перем Узел;
Перем НомерСообщения;

////////////////////////////////////////////////////////////////////
//				Процедуры подготовки данных

Процедура ПолучитьИзмененныеИзПланаОбмена(Получатель, НомерСообщения)
	
	МассивРекламаций = Новый Массив;
	
	//Получаем данные из плана обмена
	Выборка = ПланыОбмена.ВыбратьИзменения(Получатель, НомерСообщения);
	
	//Пробежимся по выборке и распределим данные по массивам
	Пока Выборка.Следующий() Цикл
		
		Данные = Выборка.Получить();
		
		МассивРекламаций.Добавить(Данные.Ссылка);
		
	КонецЦикла;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Рекламация.Ссылка КАК Рекламация,
	               |	Рекламация.Номер КАК НомерДокДилера,
	               |	Рекламация.Дата КАК ДатаДокДилера,
	               |	Рекламация.Автор.Наименование КАК АвторДилера,
	               |	Рекламация.АктОПоврежденииСТК,
	               |	Рекламация.ВалютаДокумента.Код КАК ВалютаДокумента,
	               |	Рекламация.ГосНомерАвтомобиля,
	               |	Рекламация.ДатаАктаСТК,
	               |	Рекламация.ДатаДокВх,
	               |	Рекламация.ДатаПолученияГруза,
	               |	Рекламация.ДатаСФВх,
	               |	Рекламация.ДатаТТН,
	               |	Рекламация.Количество,
	               |	Рекламация.КоличествоМестЗафактурованно,
	               |	Рекламация.КоличествоМестПовреждено,
	               |	Рекламация.КоличествоМестПолучено,
	               |	Рекламация.КоличествоНоменклатурыЗафактурованно,
	               |	Рекламация.КоличествоПлан,
	               |	Рекламация.Комментарии,
	               |	Рекламация.КомментарийДилера,
	               |	&BIR КАК BIR_Грузополучателя,
	               |	Рекламация.КурсДокумента,
	               |	Рекламация.МаркаАвтомобиля,
	               |	Рекламация.НаличиеСборочнойКарты,
	               |	Рекламация.Номенклатура.Ссылка КАК НоменклатураСсылка,
	               |	Рекламация.НоменклатураПлан.Ссылка КАК НоменклатураПланСсылка,
	               |	Рекламация.НомерАктаСТК,
	               |	Рекламация.НомерДокВх,
	               |	Рекламация.НомерКоробки,
	               |	Рекламация.НомерМеста,
	               |	Рекламация.НомерСФвх,
	               |	Рекламация.НомерТТН,
	               |	Рекламация.ПредложениеИнициатора.Наименование КАК ПредложениеИнициатора,
	               |	Рекламация.ПричинаРекламации.Код КАК ПричинаРекламации,
	               |	Рекламация.Решение.Наименование КАК Решение,
	               |	Рекламация.СкладПолучатель.Наименование КАК СкладПолучатель,
	               |	Рекламация.СкладПолучатель.Renault_SiteNr КАК НомерПунктаДоставки,
	               |	Рекламация.Сумма,
	               |	Рекламация.СуммаПлан,
	               |	Рекламация.ТранспортнаяКомпания,
	               |	Рекламация.ФИОВодителя,
	               |	Рекламация.Цена,
	               |	Рекламация.ЦенаПлан,
	               |	Рекламация.ЕдИзмерения.Ссылка КАК ЕдИзмеренияСсылка,
	               |	Рекламация.ЕдИзмеренияПлан.Ссылка КАК ЕдИзмеренияПланСсылка,
	               |	Рекламация.СтавкаНДС.Ставка КАК СтавкаНДС,
	               |	Рекламация.СтавкаНДСПлан.Ставка КАК СтавкаНДСПлан,
	               |	Рекламация.СуммаНДС,
	               |	Рекламация.СуммаНДСПлан,
	               |	Рекламация.КонтрагентГрузоотправитель.ИНН КАК ИННОрганизации
	               |ИЗ
	               |	Документ.Renault_Рекламация КАК Рекламация
	               |ГДЕ
	               |	Рекламация.Ссылка В(&МассивРекламаций)
	               |	И НЕ Рекламация.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииСтатусы.Draft)
	               |	И Рекламация.ПометкаУдаления = ЛОЖЬ"
	;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРекламаций", МассивРекламаций);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("BIR", BIR);
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаРекламаций = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуСправочников()
	
	//удалим определение документа wsdl - его добавляем автоматически
	Адрес = АдресWS +"ws/reclamations.ws";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/datatable", 
							   "Рекламации","РекламацииSoap12",600);
	
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
	СправочникиXDTO = ВебСервис.getnci();
	
	РешенияПоРекламации		 = СправочникиXDTO.РешенияПоРекламации;
	ПредложенияПоРекламации	 = СправочникиXDTO.ПредложенияПоРекламации;
	ПричиныРекламации		 = СправочникиXDTO.ПричиныРекламации;
	
	ЗагрузитьПричиныРекламации(ПричиныРекламации);
	ЗагрузитьПредложенияПоРекламациям(ПредложенияПоРекламации);
	ЗагрузитьРешенияПоРекламациям(РешенияПоРекламации);
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуДокументов()
	
	Адрес = АдресWS +"ws/reclamations.ws";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/datatable", 
							   "Рекламации","РекламацииSoap12",600);
	
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	СписокДокументовЦентра = ВебСервис.getreclamations(BIR);
	
	Если НЕ СписокДокументовЦентра = неопределено тогда
		
		ОбновитьДокументы(СписокДокументовЦентра);
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////

Функция ЗагрузитьПричиныРекламации(СписокПричин)
	
	Для каждого Причина Из СписокПричин.Причина Цикл
		
		НаименованиеПричины = Причина.Наименование;
		
		ЭлементПричина = Справочники.Renault_ПричиныРекламации.НайтиПоНаименованию(НаименованиеПричины);
		
		Если ЭлементПричина = Справочники.Renault_ПричиныРекламации.ПустаяСсылка() тогда
			ЭлементПричина = Справочники.Renault_ПричиныРекламации.СоздатьЭлемент();
			ЭтоНовый = Истина;
		Иначе
			ЭлементПричина = ЭлементПричина.ПолучитьОбъект();
			ЭтоНовый = Ложь;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПричина, Причина);
		
		Если ЭтоНовый Тогда
			Если НЕ ЭлементПричина.ПометкаУдаления тогда
				ЭлементПричина.Записать();
			КонецЕсли;
		иначе
			ЭлементПричина.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ЗагрузитьПредложенияПоРекламациям(СписокПредложений)
	
	Для каждого Предложение Из СписокПредложений.Предложение Цикл
		
		НаименованиеПредложения = Предложение.Наименование;
		
		ЭлементПредложение = Справочники.Renault_ПредложенияПоРекламациям.НайтиПоНаименованию(НаименованиеПредложения);
		
		Если ЭлементПредложение = Справочники.Renault_ПредложенияПоРекламациям.ПустаяСсылка() тогда
			ЭлементПредложение = Справочники.Renault_ПредложенияПоРекламациям.СоздатьЭлемент();
			ЭтоНовый = Истина;
		Иначе
			ЭлементПредложение = ЭлементПредложение.ПолучитьОбъект();
			ЭтоНовый = Ложь;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПредложение, Предложение);
		
		Если ЭтоНовый Тогда
			Если НЕ ЭлементПредложение.ПометкаУдаления тогда
				ЭлементПредложение.Записать();
			КонецЕсли;
		иначе
			ЭлементПредложение.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ЗагрузитьРешенияПоРекламациям(СписокРешений)
	
	Для каждого Решение Из СписокРешений.Решение Цикл
		
		НаименованиеРешения = Решение.Наименование;
		
		ЭлементРешение = Справочники.Renault_РешенияПоРекламациям.НайтиПоНаименованию(НаименованиеРешения);
		
		Если ЭлементРешение = Справочники.Renault_РешенияПоРекламациям.ПустаяСсылка() тогда
			ЭлементРешение = Справочники.Renault_РешенияПоРекламациям.СоздатьЭлемент();
			ЭтоНовый = Истина;
		Иначе
			ЭлементРешение = ЭлементРешение.ПолучитьОбъект();
			ЭтоНовый = Ложь;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементРешение, Решение);
		
		Если ЭтоНовый Тогда
			Если НЕ ЭлементРешение.ПометкаУдаления тогда
				ЭлементРешение.Записать();
			КонецЕсли;
		иначе
			ЭлементРешение.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

////@+ Процедура ОбновитьДокументы(СписокДокументов)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="02.08.2013 12:51:46" Автор="Окипний Андрей Евгеньевич">
// <Имя>ОбновитьДокументы(СписокДокументов)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>СписокДокументов</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ОбновитьДокументы(СписокДокументов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	Рекламация.Ссылка,
	|	Рекламация.Номер КАК НомерДокДилера
	|ИЗ
	|	Документ.Renault_Рекламация КАК Рекламация"
	);
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого РекламацияXDTO из СписокДокументов.Рекламация Цикл
		
		НС = ТаблицаДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, РекламацияXDTO);
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаДокументов.НомерДокДилера,
	|	ТаблицаДокументов.Ссылка
	|ПОМЕСТИТЬ ВрТЗ
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТЗ.НомерДокДилера,
	|	Рекламация.Ссылка
	|ИЗ
	|	ВрТЗ КАК ВрТЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_Рекламация КАК Рекламация
	|		ПО ВрТЗ.НомерДокДилера = Рекламация.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВрТЗ"
	);
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Для каждого РекламацияXDTO из СписокДокументов.Рекламация Цикл
		
		РекламацияСтр = ТаблицаДокументов.Найти(РекламацияXDTO.НомерДокДилера, "НомерДокДилера");
		
		Если НЕ рекламацияСтр = Неопределено тогда
			
			РекламацияДок = РекламацияСтр.Ссылка.ПолучитьОбъект();
			
			//Временно
			Если Ложь тогда
				РекламацияДок = Документы.Renault_Рекламация.СоздатьДокумент();
			КонецЕсли;
			
			РекламацияДок.НомерДокЦентра = РекламацияXDTO.НомерДокЦентра;
			РекламацияДок.Комментарии = РекламацияXDTO.КомментарийЦентра;
			РекламацияДок.Решение = Справочники.Renault_РешенияПоРекламациям.НайтиПоНаименованию(РекламацияXDTO.Решение);
			РекламацияДок.ОписаниеРешения = РекламацияДок.Решение.Описание;
			
			РекламацияДок.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы[РекламацияXDTO.ТекущийСтатус];
			
			Если НЕ РекламацияДок.ПометкаУдаления тогда
				РекламацияДок.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				РекламацияДок.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьДокументы(СписокДокументов)

Процедура ВыполнитьВыгрузкуРекламаций()
	
	ИмяФайлаВрем = ПолучитьИмяВременногоФайла("xml");
	
	//Получение узла обмена
	Узел = ПланОбмена;
	
	Запись_XML = Новый ЗаписьXML;
	Запись_XML.ОткрытьФайл(ИмяФайлаВрем);
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(Запись_XML, Узел);
	
	//Получим данные из плана обмена
	ПолучитьИзмененныеИзПланаОбмена(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	
	//Если документов нет, тогда и формировать не нужно.
	Если ВыборкаРекламаций.Количество() = 0 тогда
		
		//Выгружать нечего, просто возвращаемся
		Возврат;
		
	КонецЕсли;
	
	//Получение фабрики XDTO пакета
	Адрес = АдресWS +"ws/reclamations.ws";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/datatable", 
							   "Рекламации","РекламацииSoap12",600);
	
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
	СписокДокументов = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","СписокРекламаций_Inn"));
	
	Для Каждого стрВыборки из ВыборкаРекламаций Цикл
		
		//Подготовка данных. Выгрузка данных типа Null не возможна.
		Для Каждого Колонка из ВыборкаРекламаций.Колонки Цикл
			Если стрВыборки[Колонка.Имя] = Null тогда
				стрВыборки[Колонка.Имя] = "";
			КонецЕсли;
		КонецЦикла;
		
		РекламацияXDTO = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ДокументРекламация_Inn"));
		
		ЗаполнитьЗначенияСвойств(РекламацияXDTO, стрВыборки);
		
		//Добиваем справочники и перечисления.
		//Перечисления
		ДополнитьДанныеПеречислений(стрВыборки, РекламацияXDTO);
		
		//Справочники
		ДополнитьДанныеСправочников(стрВыборки, РекламацияXDTO);
		
		//Формирование списка фотографий.
		ДобавитьФотографии(стрВыборки, РекламацияXDTO);
		
		СписокДокументов.Рекламация.Добавить(РекламацияXDTO);
		
	КонецЦикла;
	
	Если СписокДокументов.Рекламация.Количество() > 0 тогда
		
		ВыгрузкаУспешна = ВебСервис.setreclamations(BIR, СписокДокументов);
		
		//Проставляем признак отправленных документов
		ПроставитьОтправлено();
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////
//			Дополнительно

Процедура ПроставитьОтправлено()
	
	Для каждого Документ из ВыборкаРекламаций Цикл
		
		Если Документ.Renault_Рекламация.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы.ReadyToSent тогда
			
			ДокОбъект = Документ.Renault_Рекламация.ПолучитьОбъект();
			ДокОбъект.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы.Sent;
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////@+ Процедура ДополнитьДанныеПеречислений(стрВыборки, РекламацияXDTO)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="31.07.2013 9:35:24" Автор="Окипний Андрей Евгеньевич">
// <Имя>ДополнитьДанныеПеречислений(стрВыборки, РекламацияXDTO) </Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// <Параметры>
//  <Параметр> 
//  <ИмяПараметра>стрВыборки</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
//  <Параметр>
//  <ИмяПараметра>РекламацияXDTO</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ДополнитьДанныеПеречислений(стрВыборки, РекламацияXDTO)
	
	ИндексЗначения = Перечисления.SAPPR_ВидЗаказаПоставщику.Индекс(стрВыборки.Рекламация.ТипЗаказа);
	РекламацияXDTO.ТипЗаказа = Метаданные.Перечисления.SAPPR_ВидЗаказаПоставщику.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	ИндексЗначения = Перечисления.Renault_РекламацииСтатусы.Индекс(стрВыборки.Рекламация.ТекущийСтатус);
	РекламацияXDTO.ТекущийСтатус = Метаданные.Перечисления.Renault_РекламацииСтатусы.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	ИндексЗначения = Перечисления.Renault_РекламацииВиды.Индекс(стрВыборки.Рекламация.ВидРекламации);
	РекламацияXDTO.ВидРекламации = Метаданные.Перечисления.Renault_РекламацииВиды.ЗначенияПеречисления[ИндексЗначения].Имя;
	
КонецПроцедуры // ДополнитьДанныеПеречислений(стрВыборки, РекламацияXDTO)

////@+ Процедура ДополнитьДанныеСправочников(стрВыборки, РекламацияXDTO)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="31.07.2013 9:37:00" Автор="Окипний Андрей Евгеньевич">
// <Имя>ДополнитьДанныеСправочников(стрВыборки, РекламацияXDTO) </Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// <Параметры>
//  <Параметр> 
//  <ИмяПараметра>стрВыборки</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
//  <Параметр>
//  <ИмяПараметра>РекламацияXDTO</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ДополнитьДанныеСправочников(стрВыборки, РекламацияXDTO) 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.НаименованиеИностранное,
	|	Номенклатура.Наименование,
	|	Номенклатура.НаименованиеПолное,
	|	Номенклатура.Артикул,
	|	Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатурыСсылка,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатурыСсылка,
	|	Номенклатура.Производитель КАК ПроизводительСсылка,
	|	ВЫБОР
	|		КОГДА Номенклатура.Производитель.СтранаПроисхождения ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ Номенклатура.Производитель.СтранаПроисхождения.Наименование
	|	КОНЕЦ КАК СтранаПроисхождения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка"
	;
	
	//Номенклатура
	Если ЗначениеЗаполнено(стрВыборки.Рекламация.Номенклатура) тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", стрВыборки.Рекламация.Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		
		НоменклатураXDTO = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ЭлементНоменклатура"));
		ЗаполнитьЗначенияСвойств(НоменклатураXDTO, Выборка);
		
		ИндексЗначения = Перечисления.ВидыНоменклатуры.Индекс(Выборка.ВидНоменклатурыСсылка);
		НоменклатураXDTO.ВидНоменклатуры = Метаданные.Перечисления.ВидыНоменклатуры.ЗначенияПеречисления[ИндексЗначения].Имя;
		
		
		//ТипНоменклатуры
		//+
		ТипНоменклатурыXDTO = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ЭлементТипНоменклатуры"));
		ЗаполнитьЗначенияСвойств(ТипНоменклатурыXDTO, Выборка.ТипНоменклатурыСсылка, ,"ВидНоменклатуры");
		
		ТипНоменклатурыXDTO.ОсновнаяБазоваяЕдиницаИзмеренияКод = Выборка.ТипНоменклатурыСсылка.ОсновнаяБазоваяЕдиницаИзмерения.Код;
		
		ИндексЗначения = Перечисления.ВидыНоменклатуры.Индекс(Выборка.ТипНоменклатурыСсылка.ВидНоменклатуры);
		ТипНоменклатурыXDTO.ВидНоменклатуры = Метаданные.Перечисления.ВидыНоменклатуры.ЗначенияПеречисления[ИндексЗначения].Имя;
		//-
		//////////////////////
		
		НоменклатураXDTO.ТипНоменклатуры = ТипНоменклатурыXDTO;
		
	КонецЕсли;
	
	РекламацияXDTO.Номенклатура = НоменклатураXDTO;
	
	НоменклатураXDTO	 = Неопределено;
	ТипНоменклатурыXDTO	 = Неопределено;
	
	//НоменклатураПлан
	Если ЗначениеЗаполнено(стрВыборки.Рекламация.НоменклатураПлан) тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", стрВыборки.Рекламация.НоменклатураПлан);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		
		НоменклатураXDTO = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ЭлементНоменклатура"));
		ЗаполнитьЗначенияСвойств(НоменклатураXDTO, Выборка);
		
		
		ИндексЗначения = Перечисления.ВидыНоменклатуры.Индекс(Выборка.ВидНоменклатурыСсылка);
		НоменклатураXDTO.ВидНоменклатуры = Метаданные.Перечисления.ВидыНоменклатуры.ЗначенияПеречисления[ИндексЗначения].Имя;
		
		
		//ТипНоменклатуры
		//+
		ТипНоменклатурыXDTO = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ЭлементТипНоменклатуры"));
		ЗаполнитьЗначенияСвойств(ТипНоменклатурыXDTO, Выборка.ТипНоменклатурыСсылка, ,"ВидНоменклатуры");
		
		ТипНоменклатурыXDTO.ОсновнаяБазоваяЕдиницаИзмеренияКод = Выборка.ТипНоменклатурыСсылка.ОсновнаяБазоваяЕдиницаИзмерения.Код;
		
		ИндексЗначения = Перечисления.ВидыНоменклатуры.Индекс(Выборка.ТипНоменклатурыСсылка.ВидНоменклатуры);
		ТипНоменклатурыXDTO.ВидНоменклатуры = Метаданные.Перечисления.ВидыНоменклатуры.ЗначенияПеречисления[ИндексЗначения].Имя;
		//-
		//////////////////////
		НоменклатураXDTO.ТипНоменклатуры = ТипНоменклатурыXDTO;
		
	КонецЕсли;
	
	РекламацияXDTO.НоменклатураПлан = НоменклатураXDTO;
	
	НоменклатураXDTO	 = Неопределено;
	ТипНоменклатурыXDTO	 = Неопределено;
	
КонецПроцедуры // ДополнитьДанныеСправочников(стрВыборки, РекламацияXDTO)

////@+ Процедура ДобавитьФотографии(стрВыборки, РекламацияXDTO)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="31.07.2013 11:02:50" Автор="Окипний Андрей Евгеньевич">
// <Имя>ДобавитьФотографии(стрВыборки, РекламацияXDTO) </Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// <Параметры>
//  <Параметр> 
//  <ИмяПараметра>стрВыборки</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
//  <Параметр>
//  <ИмяПараметра>РекламацияXDTO</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ДобавитьФотографии(стрВыборки, РекламацияXDTO)
	
	ТЧФотографииXDTO = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ФотографииРекламации"));
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	КартинкиИФайлы.Идентификатор,
	|	КартинкиИФайлы.ИмяФайла,
	|	КартинкиИФайлы.ДатаСохранения,
	|	КартинкиИФайлы.Комментарий,
	|	КартинкиИФайлы.Данные КАК ХранилищеДанных
	|ИЗ
	|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Объект = &Рекламация"
	);
	Запрос.УстановитьПараметр("Рекламация", стрВыборки.Рекламация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ФотографияXDTO = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","СтрокаФотография"));
		ЗаполнитьЗначенияСвойств(ФотографияXDTO, Выборка);
		
		ДДанные = Выборка.ХранилищеДанных.Получить();
		ФотографияXDTO.БинарныеДанные = ДДанные;
		
		ТЧФотографииXDTO.Фотография.Добавить(ФотографияXDTO);
		
	КонецЦикла;
	
	РекламацияXDTO.ТЧФотографии = ТЧФотографииXDTO;
	
КонецПроцедуры // ДобавитьФотографии(стрВыборки, РекламацияXDTO)

///////////////////////////////////////////
//			Точка входа

Процедура ОбработкаНаСервере() Экспорт
	
	Возврат; // не используется
	
	ВыгрузкаУспешна = Ложь;
	
	BIR =Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	//*//СокрЛП(Renault_ОбщийМодуль.ПолучитьИдентификатор(Организация));
	
	//Кусок по загрузке
	ВыполнитьЗагрузкуСправочников();
	
	ВыполнитьЗагрузкуДокументов();
	
	//Кусок по выгрузке
	Если ЗначениеЗаполнено(ПланОбмена) тогда
		
		ВыполнитьВыгрузкуРекламаций();
		
	Иначе
		
		Сообщить("Формирование отменено, Нет данных");
		
	КонецЕсли;
	
	Если ВыгрузкаУспешна тогда
		
		//Повторно запросим статусы документов.
		ВыполнитьЗагрузкуДокументов();
		
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

АдресWS	 = Константы.Renault_АдресWebСервисов.Получить();
ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
